//DEPWIT   JOB 1, NOTIFY=SYSUID
//COBRUN   EXEC   IGYWCL
//SYSIN    DD DSN=&SYSUID..COBOL.CBL(GPDEPWIT),DISP=SHR
//LKED     DD DSN=&SYSUID..COBOL.JCL(GPDEPWIT),DISP=SHR